ch10/ch10-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-26 Mon 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 10 problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 10 problems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org03a5c92">ch10-problems</a>
<ul>
<li><a href="#orgffef3fc">10-1</a></li>
<li><a href="#org12f575c">10-2</a></li>
<li><a href="#orge220f62">10-3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org03a5c92" class="outline-2">
<h2 id="org03a5c92">ch10-problems</h2>
<div class="outline-text-2" id="text-org03a5c92">
</div>
<div id="outline-container-orgffef3fc" class="outline-3">
<h3 id="orgffef3fc">10-1</h3>
<div class="outline-text-3" id="text-orgffef3fc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">asymptotic</th>
<th scope="col" class="org-left">unsorted,</th>
<th scope="col" class="org-left">sorted,</th>
<th scope="col" class="org-left">unsorted,</th>
<th scope="col" class="org-left">sorted,</th>
</tr>

<tr>
<th scope="col" class="org-left">worst-case</th>
<th scope="col" class="org-left">singly</th>
<th scope="col" class="org-left">singly</th>
<th scope="col" class="org-left">doubly</th>
<th scope="col" class="org-left">doubly</th>
</tr>

<tr>
<th scope="col" class="org-left">running time</th>
<th scope="col" class="org-left">linked</th>
<th scope="col" class="org-left">linked</th>
<th scope="col" class="org-left">linked</th>
<th scope="col" class="org-left">linked</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SEARCH(L, k)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INSERT(L, x)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(n)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DELETE(L, x)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SUCCESSOR(L, x)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PREDECESSOR(L, x)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MINIMUM(L)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(1)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MAXIMUM(L)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org12f575c" class="outline-3">
<h3 id="org12f575c">10-2</h3>
<div class="outline-text-3" id="text-org12f575c">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<pre class="example">
MAKE-HEAP()
    let L to be a new singly linked list
    return L

INSERT(L, x)
    cur = L.head
    prev = NIL
    while cur != NIL and cur.key &lt; x.key
	prev = cur
	cur = cur.next
    x.next = cur
    if prev != NIL
	prev.next = x
    else L.head = x

MINIMUM(L)
    x = L.head
    if x == NIL
	error "the heap is empty"
    return x.key

EXTRACT-MIN(L)
    if L.head == NIL
	error "the heap is empty"
    k = L.head.key
    L.head = L.head.next
    return k

UNION(La, Lb)
    let L to be a new singly linked list
    L.head = MERGE-LISTS(La.head, Lb.head)
    return L

MERGE-LISTS(ha, hb)
    if ha == NIL
	return hb
    if hb == NIL
	return ha
    if ha.key &lt; hb.key
	head = ha
	head.next = MERGE-LISTS(ha.next, hb)
    else head = hb
	 head.next = MERGE-LISTS(hb.next, ha)
    return head
</pre>
<p>
The running times of the operations are as below.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Running time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MAKE-HEAP</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INSERT</td>
<td class="org-left">\(O(n)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MINIMUM</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">EXTRACT-MIN</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">UNION</td>
<td class="org-left">\(O(m+n)\)</td>
</tr>
</tbody>
</table></li>
<li><p>
<b>b.</b>
</p>

<pre class="example">
MAKE-HEAP()
    let L to be a new doubly linked list
    return L

INSERT(L, x)
    x.next = L.nil.next
    L.nil.next.prev = x
    L.nil.next = x
    x.prev = L.nil

MINIMUM(L)
    if L.nil.next == L.nil
	error "the heap is empty"
    min = L.nil.next
    x = L.nil.next.next
    while x != L.nil
	if x.key &lt; min.key
	    min = x
    return min.key

EXTRACT-MIN(L)
    if L.nil.next == L.nil
	error "the heap is empty"
    min = L.nil.next
    x = L.nil.next.next
    while x != L.nil
	if x.key &lt; min.key
	    min = x
    min.prev.next = min.next
    min.next.prev = min.prev
    return min.key

UNION(La, Lb)
if Lb.nil.next != Lb.nil
    La.nil.prev.next = Lb.nil.next
    Lb.nil.next.prev = La.nil.prev
    Lb.nil.prev.next = La.nil
    La.nil.prev = Lb.nil.prev
return La
</pre>
<p>
The running times of the operations are as below.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Running time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MAKE-HEAP</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INSERT</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MINIMUM</td>
<td class="org-left">\(O(n)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">EXTRACT-MIN</td>
<td class="org-left">\(O(n)\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">UNION</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
</table></li>
<li><p>
<b>c.</b>
</p>

<p>
Same as b.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orge220f62" class="outline-3">
<h3 id="orge220f62">10-3</h3>
<div class="outline-text-3" id="text-orge220f62">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
We have made <code>RANDOM</code> for \(t\) times to find the result in the origin
algorithm, thus the total number of iterations within the related algorithm
is at least \(t\).
</p></li>
<li><p>
<b>b.</b>
</p>

<p>
The running time of the <b>for</b> loops is \(O(t)\), and the expected running
time of the <b>while</b> loops is \(O(E[X_t])\), thus the total expected running
time is \(O(t + E[X_t])\).
</p></li>
<li><p>
<b>c.</b>
</p>

<p>
We have
</p>
\begin{align*}
E[X_t]
&=\sum_{i=1}^{\infty}\Pr\{x\geq i\}\\
&=\sum_{r=1}^{k-1}\Big(\frac{k-r}{n}\Big)^t &,\ k\leq n\\
&\leq \sum_{r=1}^{n}(1-r/n)^t
\end{align*}</li>
<li><p>
<b>d.</b>
</p>

<p>
Let \(f(x) = x^t\), we have
</p>
\begin{align*}
f''(x)
&=t(t-1)x^{t-2}\\
&\geq 0 &,\ x\geq 0
\end{align*}
<p>
And \(f(x)\) is continuous when \(x\geq 0\), thus \(f(x)\) is convex when
\(x\geq 0\), then we have
</p>
\begin{align*}
\sum_{r=0}^{n-1}r^t
&\leq\int_{0}^{n}r^tdr\\
&=n^{t+1}/(t+1)
\end{align*}</li>
<li><p>
<b>e.</b>
</p>

<p>
We have
</p>
\begin{align*}
E[X_t]
&\leq \sum_{r=1}^{n}(1-r/n)^t\\
&=\sum_{r=0}^{n-1}(r/n)^t\\
&\leq n/(t+1)
\end{align*}</li>
<li><p>
<b>f.</b>
</p>

<p>
The expected running time of <code>COMPACT-LIST-SEARCH'(L,n,k,t)</code> is
</p>
\begin{align*}
T(n,t)
&=O(t+E[X_t])\\
&\leq O\Big(t+\frac{n}{t+1}\Big)\\
&=O(t+n/t)
\end{align*}</li>
<li><p>
<b>g.</b>
</p>

<p>
The expected value of \(t\) is the critical point of \(f(t)=t+n/t\), which
is \(\sqrt{n}\), so that <code>COMPACT-LIST-SEARCH</code> runs in \(O(\sqrt{n})\)
expected time.
</p></li>
<li><p>
<b>h.</b>
</p>

<p>
If not all the keys of the compact list is dinstinct, then the random skips
will fail between the repeated keys, when there are plenty enough repeated
keys, the random skips do not necessarily help asymptotically.
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2021-04-26 Mon 09:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
